var APP_DATA = {
  "scenes": [
    {
      "id": "0----------1",
      "name": "центр (+экспозиция -штатив) - центр (+экспозиция -штатив)1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2000,
      "initialViewParameters": {
        "yaw": 1.180568517570137,
        "pitch": 0.054922839648156696,
        "fov": 1.3918202015316714
      },
      "linkHotspots": [
        {
          "yaw": 0.3756946144611639,
          "pitch": 0.23757785336344206,
          "rotation": 5.497787143782138,
          "target": "1--1----"
        },
        {
          "yaw": 1.096567425785402,
          "pitch": 0.20869993478341442,
          "rotation": 0,
          "target": "2--1-----1"
        },
        {
          "yaw": -2.1375394444993834,
          "pitch": 0.28682462053732216,
          "rotation": 0,
          "target": "5--2-----"
        },
        {
          "yaw": 1.8996797766126257,
          "pitch": 0.3050089387203023,
          "rotation": 13.351768777756625,
          "target": "3--2---"
        },
        {
          "yaw": -2.8026259479991573,
          "pitch": 0.2652032852540245,
          "rotation": 5.497787143782138,
          "target": "4--3------"
        },
        {
          "yaw": -1.4354406011664302,
          "pitch": 0.2505912256361178,
          "rotation": 7.0685834705770345,
          "target": "6--4------1"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1--1----",
      "name": "диагональ 1 (+экс - штатив)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1920,
      "initialViewParameters": {
        "yaw": 2.9461169473928415,
        "pitch": 0.09744761601740137,
        "fov": 1.4390866472079973
      },
      "linkHotspots": [
        {
          "yaw": -1.4577642311444858,
          "pitch": 0.2656646320574705,
          "rotation": 0,
          "target": "3--2---"
        },
        {
          "yaw": -0.5494051359095451,
          "pitch": 0.18388220705186775,
          "rotation": 5.497787143782138,
          "target": "4--3------"
        },
        {
          "yaw": -1.9204932144875109,
          "pitch": 0.3233857864359564,
          "rotation": 5.497787143782138,
          "target": "2--1-----1"
        },
        {
          "yaw": -0.1850998292657291,
          "pitch": 0.17991515553786286,
          "rotation": 0,
          "target": "2--1-----1"
        },
        {
          "yaw": 0.25773183752002105,
          "pitch": 0.21241518129428805,
          "rotation": 0.7853981633974483,
          "target": "6--4------1"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.6554036677428474,
          "pitch": 0.4672006277518346,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.087546525316877,
          "pitch": 0.17841012222263153,
          "title": "Миниатюра гимназии",
          "text": "Text"
        },
        {
          "yaw": 1.9078476749241977,
          "pitch": -0.0893138303886527,
          "title": "Этапы развития учебного заведения",
          "text": "Text"
        },
        {
          "yaw": 0.8486041426700162,
          "pitch": -0.05689718872113758,
          "title": "Символика гимназии",
          "text": "Text"
        },
        {
          "yaw": 2.5783408376709547,
          "pitch": -0.10090491254919343,
          "title": "Руководители учебного заведения",
          "text": "Text"
        },
        {
          "yaw": -2.923377663250653,
          "pitch": -0.19429121091108037,
          "title": "Первый состав пед. коллектива",
          "text": "Text"
        },
        {
          "yaw": -2.525719053840561,
          "pitch": -0.12970607830223813,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -2.515563409922775,
          "pitch": 0.4021606921713765,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 3.0942637825228356,
          "pitch": -0.20575506532528998,
          "title": "Предыстория гимназии и первый директор",
          "text": "Text"
        },
        {
          "yaw": -2.9287236700915766,
          "pitch": 0.04529762039576113,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -3.0765890410675976,
          "pitch": 0.438582713624907,
          "title": "Title",
          "text": "Text"
        }
      ]
    },
    {
      "id": "2--1-----1",
      "name": "экватор 1 теперь точно ровно (-штатив)1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1920,
      "initialViewParameters": {
        "yaw": 2.5420880749698327,
        "pitch": 0.08156347738219694,
        "fov": 1.4390866472079973
      },
      "linkHotspots": [
        {
          "yaw": 1.053063068341448,
          "pitch": 0.29099949617722487,
          "rotation": 0.7853981633974483,
          "target": "1--1----"
        },
        {
          "yaw": -2.0701823391117564,
          "pitch": 0.41881776429180384,
          "rotation": 12.566370614359176,
          "target": "3--2---"
        },
        {
          "yaw": -1.0168436909367635,
          "pitch": 0.19853214908370198,
          "rotation": 5.497787143782138,
          "target": "4--3------"
        },
        {
          "yaw": -0.24054193328053408,
          "pitch": 0.1780459453318528,
          "rotation": 0.7853981633974483,
          "target": "6--4------1"
        },
        {
          "yaw": -0.6289180739181681,
          "pitch": 0.17197663844955713,
          "rotation": 0,
          "target": "2--1-----1"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.171413024104094,
          "pitch": -0.2091557023243844,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.923359234763966,
          "pitch": -0.17616698592586033,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.767518875323981,
          "pitch": 0.6346436064806973,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.0661244933110297,
          "pitch": 0.6104794138390144,
          "title": "Title",
          "text": "Text"
        }
      ]
    },
    {
      "id": "3--2---",
      "name": "диагональ 2 (+экс -штатив)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1920,
      "initialViewParameters": {
        "yaw": 3.1139227362476687,
        "pitch": 0.2299041112124769,
        "fov": 1.4390866472079973
      },
      "linkHotspots": [
        {
          "yaw": 0.25545286236240905,
          "pitch": 0.22066813877304803,
          "rotation": 0,
          "target": "1--1----"
        },
        {
          "yaw": 0.6663218014453562,
          "pitch": 0.3944394221329883,
          "rotation": 7.0685834705770345,
          "target": "2--1-----1"
        },
        {
          "yaw": -1.2333861412354459,
          "pitch": 0.17202663414099106,
          "rotation": 0,
          "target": "2--1-----1"
        },
        {
          "yaw": -0.868431306635804,
          "pitch": 0.16089227301961806,
          "rotation": 0.7853981633974483,
          "target": "6--4------1"
        },
        {
          "yaw": -1.6795956304656077,
          "pitch": 0.18590685306549304,
          "rotation": 5.497787143782138,
          "target": "4--3------"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.7737153946598916,
          "pitch": 0.38035774642572484,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -2.8404363714587735,
          "pitch": -0.16679802749041528,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -2.3979524009519544,
          "pitch": 0.2568842484007856,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 1.9868856316647463,
          "pitch": -0.18689695345245383,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 1.4578125454732724,
          "pitch": -0.19095085045201543,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 1.4174570090036944,
          "pitch": 0.45575145031883046,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.016845620651302,
          "pitch": 0.42771340181197104,
          "title": "Title",
          "text": "Text"
        }
      ]
    },
    {
      "id": "4--3------",
      "name": "диагональ 3 (+экс -бб - штатив)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1920,
      "initialViewParameters": {
        "yaw": 2.9426347128490864,
        "pitch": 0.11143266107688632,
        "fov": 1.3918202015316714
      },
      "linkHotspots": [
        {
          "yaw": -2.0010844653611652,
          "pitch": 0.4303257086842578,
          "rotation": 5.497787143782138,
          "target": "5--2-----"
        },
        {
          "yaw": -1.7231790015800925,
          "pitch": 0.21669434775843044,
          "rotation": 18.84955592153877,
          "target": "6--4------1"
        },
        {
          "yaw": 0.1918872739881472,
          "pitch": 0.18470163375659254,
          "rotation": 0.7853981633974483,
          "target": "3--2---"
        },
        {
          "yaw": -0.22574699995831793,
          "pitch": 0.15523304566793428,
          "rotation": 0,
          "target": "2--1-----1"
        },
        {
          "yaw": -0.618151377620082,
          "pitch": 0.15171206463643472,
          "rotation": 5.497787143782138,
          "target": "1--1----"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.7951742476264734,
          "pitch": 0.7390122401201467,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 1.0044027450444268,
          "pitch": 0.31591054690817444,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.877866515198405,
          "pitch": -0.1018441101200942,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -2.798197623514305,
          "pitch": -0.08381352077079995,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.8734868182162625,
          "pitch": 0.5562698485387472,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -2.7534683882885886,
          "pitch": 0.5529506395101293,
          "title": "Title",
          "text": "Text"
        }
      ]
    },
    {
      "id": "5--2-----",
      "name": "экватор 2 (+экс -бб -штатив)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1920,
      "initialViewParameters": {
        "yaw": 2.5752905286458807,
        "pitch": 0.0860754891404234,
        "fov": 1.3020089782460897
      },
      "linkHotspots": [
        {
          "yaw": 1.2622686715592337,
          "pitch": 0.38147462742762883,
          "rotation": 18.06415775814132,
          "target": "4--3------"
        },
        {
          "yaw": -2.440109710252429,
          "pitch": 0.2900987957194534,
          "rotation": 13.351768777756625,
          "target": "6--4------1"
        },
        {
          "yaw": -0.5551803340666321,
          "pitch": 0.15843745884900606,
          "rotation": 0,
          "target": "2--1-----1"
        },
        {
          "yaw": -0.9854737967426672,
          "pitch": 0.16653271772792877,
          "rotation": 5.497787143782138,
          "target": "1--1----"
        },
        {
          "yaw": -0.06839038608552173,
          "pitch": 0.18049849670820528,
          "rotation": 0.7853981633974483,
          "target": "3--2---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.2277305738970243,
          "pitch": -0.10779580938353384,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.826593226802821,
          "pitch": -0.10403531204836725,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.141568318818857,
          "pitch": 0.5756073667999253,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 2.891188249419521,
          "pitch": 0.5873509281231328,
          "title": "Title",
          "text": "Text"
        }
      ]
    },
    {
      "id": "6--4------1",
      "name": "диагональ 4 (+эксп - бб- штатив)1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1920,
      "initialViewParameters": {
        "yaw": 2.4751270199947406,
        "pitch": -0.001350260140362991,
        "fov": 1.4390866472079973
      },
      "linkHotspots": [
        {
          "yaw": 0.5425343114405852,
          "pitch": 0.40277348742026753,
          "rotation": 7.0685834705770345,
          "target": "5--2-----"
        },
        {
          "yaw": 0.3481163710325852,
          "pitch": 0.2491835919521197,
          "rotation": 0,
          "target": "4--3------"
        },
        {
          "yaw": -1.0448645970278765,
          "pitch": 0.1512768125177395,
          "rotation": 0,
          "target": "2--1-----1"
        },
        {
          "yaw": -1.508335267269386,
          "pitch": 0.16963579572048637,
          "rotation": 5.497787143782138,
          "target": "1--1----"
        },
        {
          "yaw": -0.6372755548286655,
          "pitch": 0.17976379865880077,
          "rotation": 0.7853981633974483,
          "target": "1--1----"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.132672678558997,
          "pitch": 0.5495821553439466,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 1.7987680968567155,
          "pitch": 0.6069423977263124,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 1.1935903703438946,
          "pitch": -0.09378628209320894,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 1.829473003361505,
          "pitch": -0.09819203836217838,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": 3.0922529149001683,
          "pitch": -0.16710108198229,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -2.606780807924684,
          "pitch": -0.16621498486890118,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -2.86964676432706,
          "pitch": 0.6274839632234794,
          "title": "Title",
          "text": "Text"
        },
        {
          "yaw": -1.9749438386720062,
          "pitch": 0.4051119733035673,
          "title": "Title",
          "text": "Text"
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": true,
    "viewControlButtons": true
  }
};
